rs/*raw_schedule*/ = { 
	"end_time" : 61200, 
	"default" : { "ud":"放学", "cls":"放学啦", "bgc":"b" },
	"schedule" : [
		{ "start":[8,0,0], "ud":"开学", "cls":"课前", "bgc":"b" }, 
		{ "start":[8,40,0], "ud":"下课", "cls":"第一节", "bgc":"c" }, 
		{ "start":[8,50,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[9,30,0], "ud":"下课", "cls":"第二节", "bgc":"c"},
		{ "start":[9,40,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[10,20,0], "ud":"下课", "cls":"第三节", "bgc":"c"},
		{ "start":[10,50,0], "ud":"上课", "cls":"大课间", "bgc":"g"},
		{ "start":[11,30,0], "ud":"下课", "cls":"第四节", "bgc":"c"},
		{ "start":[11,40,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[12,20,0], "ud":"下课", "cls":"第五节", "bgc":"c"},
		
		{ "start":[13,55,0], "ud":"下课", "cls":"午间", "bgc":"g"},
		{ "start":[14,0,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[14,10,0], "ud":"上课", "cls":"课前十分钟", "bgc":"g"},
		{ "start":[14,50,0], "ud":"下课", "cls":"第六课", "bgc":"c"},
		{ "start":[15,0,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[15,40,0], "ud":"下课", "cls":"第七课", "bgc":"c"},
		{ "start":[15,50,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[16,30,0], "ud":"下课", "cls":"第八课", "bgc":"c"},
		{ "start":[16,40,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[17,20,0], "ud":"下课", "cls":"延一", "bgc":"c"},
		{ "start":[17,30,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[18,10,0], "ud":"下课", "cls":"延二", "bgc":"c"},
		{ "start":[18,20,0], "ud":"上课", "cls":"下课", "bgc":"b"},
		{ "start":[19,00,0], "ud":"放学", "cls":"延三", "bgc":"c"},
				
		{ "start":[22,50,0], "ud":"?", "cls":"?", "bgc":"b"}
	] 
};

// rs/*备用预设*/ = { 
// 	"end_time" : 61200, 
// 	"default" : { "ud":"放学", "cls":"放学啦", "bgc":"b" },
// 	"schedule" : [
// 		{ "start":[8,0,0], "ud":"开学", "cls":"课前", "bgc":"b" }, 
// 		{ "start":[8,40,0], "ud":"下课", "cls":"第一节", "bgc":"c" }, 
// 		{ "start":[8,50,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[9,50,0], "ud":"下课", "cls":"第二节", "bgc":"c"},
// 		{ "start":[10,0,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[10,40,0], "ud":"下课", "cls":"第三节", "bgc":"c"},
// 		{ "start":[10,50,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[11,30,0], "ud":"下课", "cls":"第四节", "bgc":"c"},
// 		{ "start":[11,40,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[12,20,0], "ud":"下课", "cls":"第五节", "bgc":"c"},
		
// 		{ "start":[13,55,0], "ud":"下课", "cls":"午间", "bgc":"g"},
// 		{ "start":[14,0,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[14,10,0], "ud":"上课", "cls":"课前十分钟", "bgc":"g"},
// 		{ "start":[14,50,0], "ud":"下课", "cls":"第六课", "bgc":"c"},
// 		{ "start":[15,0,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[15,40,0], "ud":"下课", "cls":"第七课", "bgc":"c"},
// 		{ "start":[15,50,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[16,30,0], "ud":"下课", "cls":"第八课", "bgc":"c"},
// 		{ "start":[16,40,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[17,20,0], "ud":"下课", "cls":"延一", "bgc":"c"},
// 		{ "start":[17,30,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[18,10,0], "ud":"下课", "cls":"延二", "bgc":"c"},
// 		{ "start":[18,20,0], "ud":"上课", "cls":"下课", "bgc":"b"},
// 		{ "start":[19,00,0], "ud":"放学", "cls":"延三", "bgc":"c"},
				
// 		{ "start":[22,50,0], "ud":"?", "cls":"?", "bgc":"b"}
// 	] 
// };

schedule = rs;
